<?php
return [

    /*
     * |--------------------------------------------------------------------------
     * | API Error Message Language Lines
     * |--------------------------------------------------------------------------
     * |
     * | The following language lines are used during API Error Message for various
     * | messages that we need to display to the user. You are free to modify
     * | these language lines according to your application's requirements.
     * |
     */

    '1000' => '成功',

    /* 已存在 */
    '1101' => '用户名已存在',
    '1102' => '联络电话已存在',
    '1103' => '银行账号已存在',
    '1104' => '钱包地址已存在',

    /* 不存在 */
    '1201' => '用户名不存在',
    '1202' => '推荐码不存在',

    /* 已设置 */
    '1301' => '电子邮件已设置',
    '1302' => '姓名已设置',
    '1303' => '资金密码已设置',
    '1304' => '银行账号已设置',
    '1305' => '钱包地址已设置',

    /* 前置流程 */
    '1401' => '请先完成实名认证',

    //1500:金流相關
    '1500' => '钱包馀额不足',
    '1501' => '汇率己变动, 请稍后再试',
    '1502' => '查无银行',
    '1503' => '手续费已变动, 请稍后再试',
    '1521' => '查無充值訂單',
    '1522' => '己上傳充值訂單圖片',

    /* 通用数据 */
    '2001' => '数据库错误，请稍后再试',
    '2002' => '数据格式验证错误',
    '2003' => '数量不足',
    '2037' => '您已经点击超过:values次，请稍后再尝试。',

    /* 字段验证 */
    '3001' => '请输入头像ID',
    '3002' => '请输入用户名',
    '3003' => '请输入密码',
    '3004' => '请输入联络电话',
    '3005' => '请输入验证码',
    '3006' => '请输入推荐码',
    '3007' => '请输入图形验证码Key',
    '3008' => '请输入图形验证码',
    '3009' => '请输入电子邮件',
    '3010' => '请输入姓名',
    '3011' => '请输入旧密码',
    '3012' => '请输入新密码',
    '3013' => '请输入资金密码',
    '3014' => '请输入旧资金密码',
    '3015' => '请输入新资金密码',
    '3016' => '请输入银行ID',
    '3017' => '请输入银行账户名',
    '3018' => '请输入银行账号',
    '3019' => '请输入钱包地址',
    '3020' => '请输入矿机ID',
    '3021' => '请输入矿机类型',
    '3022' => '请输入数量',
    '3023' => '请输入会员矿机ID列表',
    '3024' => '请输入会员矿机ID',
    '3025' => '请输入试算日期',
    '3026' => '请输入收款银行账号ID',
    '3027' => '请输入手续费类型',
    '3028' => '请输入手续费',
    '3029' => '请输入域名',

    '4001' => '头像ID请输入数字',
    '4002' => '联络电话请输入数字',

    '5001' => '图形验证码错误',
    '5002' => '验证码错误',
    '5003' => '账号或密码错误',
    '5004' => '旧密码错误',
    '5005' => '旧资金密码错误',
    '5006' => '电子邮件错误',
    '5007' => '用户名错误',
    '50071' => '用户名格式错误',
    '5008' => '密码错误',
    '50081' => '密码格式错误',
    '5009' => '确认密码错误',
    '5010' => '推荐码错误',
    '5011' => '图形验证码Key错误',
    '5012' => '姓名错误',
    '5013' => '新密码错误',
    '5014' => '确认新密码错误',
    '5015' => '资金密码错误',
    '5016' => '确认资金密码错误',
    '5017' => '新资金密码错误',
    '5018' => '确认新资金密码错误',
    '5019' => '银行ID错误',
    '5020' => '银行账户名错误',
    '5021' => '银行账号错误',
    '5022' => '钱包地址错误',
    '5023' => '矿机ID错误',
    '5024' => '矿机类型错误',
    '5025' => '数量错误',
    '5026' => '周期错误',
    '5027' => '会员矿机ID列表错误',
    '5028' => '会员矿机ID错误',
    '5029' => '试算日期错误',
    '5030' => '收款银行账号ID错误',
    '5031' => '手续费类型错误',
    '5032' => '手续费错误',
    '5033' => '域名错误',
    '5034' => '无支持银行户口',
    '5035' => '类型错误',

    '6001' => '有不可使用的字符 \':value\'',
    '6002' => '不能与登入密码相同',

    '7001' => '团购失败',
    '7002' => '取消失败',
    '7003' => '出售失败',

    /* 系统错误 */
    '9001' => '查无此资料',
    '9006' => '账号锁定中',
    '90061' => '账号锁定中',
    '90062' => '账号锁定中，请联系客服',
    '9998' => 'Token错误',
    '9999' => '验证错误'
];
