<?php
return [

    /*
     * |--------------------------------------------------------------------------
     * | API Error Message Language Lines
     * |--------------------------------------------------------------------------
     * |
     * | The following language lines are used during API Error Message for various
     * | messages that we need to display to the user. You are free to modify
     * | these language lines according to your application's requirements.
     * |
     */

    '1000' => '成功',

    /* 已存在 */
    '1101' => '用戶名已存在',
    '1102' => '聯絡電話已存在',
    '1103' => '銀行帳號已存在',
    '1104' => '錢包地址已存在',

    /* 不存在 */
    '1201' => '用戶名不存在',
    '1202' => '推薦碼不存在',

    /* 已設置 */
    '1301' => '電子郵件已設置',
    '1302' => '姓名已設置',
    '1303' => '資金密碼已設置',
    '1304' => '銀行帳號已設置',
    '1305' => '錢包地址已設置',

    /* 前置流程 */
    '1401' => '請先完成實名認證',

    //1500:金流相關
    '1500' => '餘額不足',
    '1501' => '匯率已變動, 請稍後再試',
    '1502' => '查無銀行',
    '1503' => '手續費已變動, 請稍後再試',
    '1521' => '查無充值訂單',
    '1522' => '已上傳充值訂單圖片',

    /* 通用資料 */
    '2001' => '數據庫錯誤，請稍後再試',
    '2002' => '資料格式驗證錯誤',
    '2003' => '數量不足',
    '2037' => '您已經點擊超過:values次，請稍後再嘗試。',

    /* 欄位驗證 */
    '3001' => '請輸入頭像ID',
    '3002' => '請輸入用戶名',
    '3003' => '請輸入密碼',
    '3004' => '請輸入聯絡電話',
    '3005' => '請輸入驗證碼',
    '3006' => '請輸入推薦碼',
    '3007' => '請輸入圖形驗證碼Key',
    '3008' => '請輸入圖形驗證碼',
    '3009' => '請輸入電子郵件',
    '3010' => '請輸入姓名',
    '3011' => '請輸入舊密碼',
    '3012' => '請輸入新密碼',
    '3013' => '請輸入資金密碼',
    '3014' => '請輸入舊資金密碼',
    '3015' => '請輸入新資金密碼',
    '3016' => '請輸入銀行ID',
    '3017' => '請輸入銀行帳戶名',
    '3018' => '請輸入銀行帳號',
    '3019' => '請輸入錢包地址',
    '3020' => '請輸入礦機ID',
    '3021' => '請輸入礦機類型',
    '3022' => '請輸入數量',
    '3023' => '請輸入會員礦機ID列表',
    '3024' => '請輸入會員礦機ID',
    '3025' => '請輸入試算日期',
    '3026' => '請輸入收款銀行帳號ID',
    '3027' => '請輸入手續費類型',
    '3028' => '請輸入手續費',
    '3029' => '請輸入域名',

    '4001' => '頭像ID請輸入數字',
    '4002' => '聯絡電話請輸入數字',

    '5001' => '圖形驗證碼錯誤',
    '5002' => '驗證碼錯誤',
    '5003' => '帳號或密碼錯誤',
    '5004' => '舊密碼錯誤',
    '5005' => '舊資金密碼錯誤',
    '5006' => '電子郵件錯誤',
    '5007' => '用戶名錯誤',
    '50071' => '用戶名格式錯誤',
    '5008' => '密碼錯誤',
    '50081' => '密碼格式錯誤',
    '5009' => '確認密碼錯誤',
    '5010' => '推薦碼錯誤',
    '5011' => '圖形驗證碼Key錯誤',
    '5012' => '姓名錯誤',
    '5013' => '新密碼錯誤',
    '5014' => '確認新密碼錯誤',
    '5015' => '資金密碼錯誤',
    '5016' => '確認資金密碼錯誤',
    '5017' => '新資金密碼錯誤',
    '5018' => '確認新資金密碼錯誤',
    '5019' => '銀行ID錯誤',
    '5020' => '銀行帳戶名錯誤',
    '5021' => '銀行帳號錯誤',
    '5022' => '錢包地址錯誤',
    '5023' => '礦機ID錯誤',
    '5024' => '礦機類型錯誤',
    '5025' => '數量錯誤',
    '5026' => '週期錯誤',
    '5027' => '會員礦機ID列表錯誤',
    '5028' => '會員礦機ID錯誤',
    '5029' => '試算日期錯誤',
    '5030' => '收款銀行帳號ID錯誤',
    '5031' => '手續費類型錯誤',
    '5032' => '手續費錯誤',
    '5033' => '域名錯誤',
    '5034' => '無支援銀行戶口',
    '5035' => '類型錯誤',

    '6001' => '有不可使用的字元 \':value\'',
    '6002' => '不能與登入密碼相同',

    '7001' => '團購失敗',
    '7002' => '取消失敗',
    '7003' => '出售失敗',

    /* 系統錯誤 */
    '9001' => '查無此資料',
    '9006' => '帳號鎖定中',
    '90061' => '帳號鎖定中',
    '90062' => '帳號鎖定中，請聯繫客服',
    '9998' => 'Token錯誤',
    '9999' => '驗證錯誤'
];
